In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math
from sklearn.linear_model import LinearRegression

In [8]:
df = pd.read_csv("homeprices.csv")
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  680000
4  4000       5.0    8  725000

In [9]:
df.bedrooms.median()
#median값은 mean이 아니라 숫자 목록 중간의 값

3.5

In [10]:
median_bedrooms = math.floor(df.bedrooms.median())
#floor:버림
median_bedrooms

3

In [12]:
df.bedrooms = df.bedrooms.fillna(median_bedrooms)
#median값을 데이터프래임에 추가
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       3.0   18  610000
3  3600       3.0   30  680000
4  4000       5.0    8  725000

In [17]:
df[['area', 'bedrooms', 'age']]

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       3.0   18
3  3600       3.0   30
4  4000       5.0    8

In [16]:
reg = LinearRegression()
reg.fit(df[['area', 'bedrooms', 'age']], df.price)

LinearRegression()

In [18]:
reg.coef_

array([  143.625, -6762.5  ,   337.5  ])

In [19]:
reg.intercept_

173112.50000000012

In [22]:
reg.predict([[3000, 3, 40]])

array([597200.])